In [7]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [8]:
names = {10: 'Nourah', 12: 'Sarah', 13: 'Ahmed'}
s3 = pd.Series(names)
s3

10    Nourah
12     Sarah
13     Ahmed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [9]:
s3.index = [11, 12,13]

## Q3: Retrieve First and second elements.

In [10]:
s3[:2]

11    Nourah
12     Sarah
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [12]:
s4 = pd.Series({50: 'Ahmed', 60: 'Nada'})
s3 = s3.append(s4)
print(s3)
s3.drop_duplicates()

11    Nourah
12     Sarah
13     Ahmed
50     Ahmed
60      Nada
50     Ahmed
60      Nada
dtype: object

C:\Users\luka3\AppData\Local\Temp\ipykernel_35172\2554766657.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s3 = s3.append(s4)

11    Nourah
12     Sarah
13     Ahmed
60      Nada
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [16]:
 students =  {'ID': [1, 2, 3, 4, 5, 6, 7],
        'Name': ['Kathey', 'Michael', 'William', 'Kathey', 'William', 'Kathey', 'Michael'],
        'GPA': ['3.5', '5', '4.4', '3.76', '3.1', '3.2', '2.74']
       }

SDF = pd.DataFrame(students, columns=['ID', 'Name', 'GPA'])
SDF

   ID     Name   GPA
0   1   Kathey   3.5
1   2  Michael     5
2   3  William   4.4
3   4   Kathey  3.76
4   5  William   3.1
5   6   Kathey   3.2
6   7  Michael  2.74

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [19]:
edu = pd.read_csv("/Users/luka3/Desktop/DS&ML/educ_figdp_1_Data.csv")
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [26]:
names = {0: 'Nourah', 1: 'Sarah', 2: 'Ahmed'}
s3 = pd.Series(names)
s3

0    Nourah
1     Sarah
2     Ahmed
dtype: object

In [27]:
s3.loc[0:2]

0    Nourah
1     Sarah
2     Ahmed
dtype: object

In [28]:
s3[0:2]

0    Nourah
1     Sarah
dtype: object